#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_E9AC643D4F8E10A8DA0B55AAC496A021
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_E9AC643D4F8E10A8DA0B55AAC496A021_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_31B85E65417FD5B749A7D1941CE581F2
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_31B85E65417FD5B749A7D1941CE581F2_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_2396020B435F19A36A0A74B66AEF983F
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_2396020B435F19A36A0A74B66AEF983F_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_E53448EF44FAA6932E61C5AB75F0A934
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_E53448EF44FAA6932E61C5AB75F0A934_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendSpacePlayer_CDFFEF5745992E802E51E7B988C735E9
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendSpacePlayer_CDFFEF5745992E802E51E7B988C735E9_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendSpacePlayer_245B08CA475D77EAA94BC791564F1191
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendSpacePlayer_245B08CA475D77EAA94BC791564F1191_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendListByBool_8AC200CC47265449E4F29B87E0E6813A
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendListByBool_8AC200CC47265449E4F29B87E0E6813A_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendListByEnum_BA77578B4776A584119097BD7AF60F6A
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendListByEnum_BA77578B4776A584119097BD7AF60F6A_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendSpacePlayer_DBFF2A3D4873EADCFC4B20A49F6AD788
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendSpacePlayer_DBFF2A3D4873EADCFC4B20A49F6AD788_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendSpacePlayer_57BDF19A4F945C97D596E7B9283B1FE0
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendSpacePlayer_57BDF19A4F945C97D596E7B9283B1FE0_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendListByBool_99A7CC204C2BC62DDC7648B22CEF2CC9
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendListByBool_99A7CC204C2BC62DDC7648B22CEF2CC9_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_9C4B3BDD4AFC09C5F081429CB94C1218
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_9C4B3BDD4AFC09C5F081429CB94C1218_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_8AFC253A4FA076FED632509B05A08B1F
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_8AFC253A4FA076FED632509B05A08B1F_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_423BB37F40D8138856C4A6A2FCB47BF5
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_423BB37F40D8138856C4A6A2FCB47BF5_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_F4C95533411A95A9F762BB9FD76A53F4
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_F4C95533411A95A9F762BB9FD76A53F4_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_0A47267A49936464E45E1394F3DFAB0B
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_0A47267A49936464E45E1394F3DFAB0B_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendListByBool_F870855E42358A3AE9FFCEA8148515CF
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendListByBool_F870855E42358A3AE9FFCEA8148515CF_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendListByBool_2124E040464EE301C3806EB6310AA731
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_BlendListByBool_2124E040464EE301C3806EB6310AA731_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_LayeredBoneBlend_BCA9A2E04E0B18A136F136A5568421AD
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_LayeredBoneBlend_BCA9A2E04E0B18A136F136A5568421AD_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TwoBoneIK_60EFAEA943B8F364186B499519B5FD1B
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TwoBoneIK_60EFAEA943B8F364186B499519B5FD1B_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TwoBoneIK_4F6075D44B5DB20527031CA1AF9B0E10
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TwoBoneIK_4F6075D44B5DB20527031CA1AF9B0E10_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_D459C88940BDBABEB803EC8C749D6A1D
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_D459C88940BDBABEB803EC8C749D6A1D_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_FAEC6E854E39405FA5831D8F5A110DFF
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_FAEC6E854E39405FA5831D8F5A110DFF_Params
{
public:
};

// 0x4 (0x4 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.BlueprintUpdateAnimation
struct UMaleSurvivorAnimBlueprint_C_BlueprintUpdateAnimation_Params
{
public:
	float                                        DeltaTimeX;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.BlueprintInitializeAnimation
struct UMaleSurvivorAnimBlueprint_C_BlueprintInitializeAnimation_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.AnimNotify_SurvivorIdleDefaultEnded
struct UMaleSurvivorAnimBlueprint_C_AnimNotify_SurvivorIdleDefaultEnded_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.AnimNotify_SurvivorIdleCowerEnded
struct UMaleSurvivorAnimBlueprint_C_AnimNotify_SurvivorIdleCowerEnded_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.AnimNotify_SurvivorIdleCowerBreakEnded
struct UMaleSurvivorAnimBlueprint_C_AnimNotify_SurvivorIdleCowerBreakEnded_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.AnimNotify_SurvivorIdleDefaultBreakEnded
struct UMaleSurvivorAnimBlueprint_C_AnimNotify_SurvivorIdleDefaultBreakEnded_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_DC38DF88419C50A445BC738043D38E33
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_DC38DF88419C50A445BC738043D38E33_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.AnimNotify_MedBot_Revive_Done
struct UMaleSurvivorAnimBlueprint_C_AnimNotify_MedBot_Revive_Done_Params
{
public:
};

// 0x0 (0x0 - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_897CDDDF48EACA4D93120F9D029B71E7
struct UMaleSurvivorAnimBlueprint_C_EvaluateGraphExposedInputs_ExecuteUbergraph_MaleSurvivorAnimBlueprint_AnimGraphNode_TransitionResult_897CDDDF48EACA4D93120F9D029B71E7_Params
{
public:
};

// 0x9B (0x9B - 0x0)
// Function MaleSurvivorAnimBlueprint.MaleSurvivorAnimBlueprint_C.ExecuteUbergraph_MaleSurvivorAnimBlueprint
struct UMaleSurvivorAnimBlueprint_C_ExecuteUbergraph_MaleSurvivorAnimBlueprint_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0xA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue1;                 // 0xB(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanOR_ReturnValue;                    // 0xC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanOR_ReturnValue1;                   // 0xD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_EqualEqual_FloatFloat_ReturnValue1;       // 0xE(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue1;                  // 0xF(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanOR_ReturnValue12;                  // 0x11(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue12;                // 0x12(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue123;               // 0x13(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                        K2Node_Event_DeltaTimeX;                           // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue1234;              // 0x19(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsPlayingRootMotion_ReturnValue;          // 0x1A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue;           // 0x1B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x1C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_31C0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortAIPawn*                           CallFunc_TryGetFortAIPawn_ReturnValue;             // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanAND_ReturnValue12;                 // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue;              // 0x29(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue123;                // 0x2A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_31C1[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue1;                  // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_31C2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APawn*                                 CallFunc_TryGetPawnOwner_ReturnValue;              // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                 CallFunc_TryGetPawnOwner_ReturnValue1;             // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                           K2Node_DynamicCast_AsFort_AIPawn;                  // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x58(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_31C3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AFortAIPawn*                           K2Node_DynamicCast_AsFort_AIPawn1;                 // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess1;                      // 0x68(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_31C4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APawn*                                 CallFunc_TryGetPawnOwner_ReturnValue12;            // 0x70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                           K2Node_DynamicCast_AsFort_AIPawn12;                // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess12;                     // 0x80(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue1;         // 0x81(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_31C5[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APawn*                                 CallFunc_TryGetPawnOwner_ReturnValue123;           // 0x88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                           K2Node_DynamicCast_AsFort_AIPawn123;               // 0x90(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess123;                    // 0x98(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanOR_ReturnValue123;                 // 0x99(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanOR_ReturnValue1234;                // 0x9A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
