#pragma once

// Dumped with Dumper-7!

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0xC88 (0xC88 - 0x0)
// Function RewardInfoButtonWidget.RewardInfoButtonWidget_C.GetDisplayName
struct URewardInfoButtonWidget_C_GetDisplayName_Params
{
public:
	class FText                                  DisplayName;                                       // 0x0(0x18)(Parm, OutParm)
	class FText                                  OutName;                                           // 0x18(0x18)(Edit, BlueprintVisible)
	enum class EFortItemType                     Temp_byte_Variable;                                // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4974[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable;                                // 0x38(0x18)()
	class FText                                  Temp_text_Variable1;                               // 0x50(0x18)()
	class FText                                  Temp_text_Variable12;                              // 0x68(0x18)()
	class FText                                  Temp_text_Variable123;                             // 0x80(0x18)()
	class FText                                  Temp_text_Variable1234;                            // 0x98(0x18)()
	class FText                                  Temp_text_Variable12345;                           // 0xB0(0x18)()
	class FText                                  Temp_text_Variable123456;                          // 0xC8(0x18)()
	class FText                                  Temp_text_Variable1234567;                         // 0xE0(0x18)()
	class FText                                  Temp_text_Variable12345678;                        // 0xF8(0x18)()
	class FText                                  Temp_text_Variable123456789;                       // 0x110(0x18)()
	class FText                                  Temp_text_Variable12345678910;                     // 0x128(0x18)()
	class FText                                  Temp_text_Variable1234567891011;                   // 0x140(0x18)()
	class FText                                  Temp_text_Variable123456789101112;                 // 0x158(0x18)()
	class FText                                  Temp_text_Variable12345678910111213;               // 0x170(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314;             // 0x188(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415;           // 0x1A0(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516;         // 0x1B8(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617;       // 0x1D0(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718;     // 0x1E8(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819;   // 0x200(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920; // 0x218(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021; // 0x230(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122; // 0x248(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223; // 0x260(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324; // 0x278(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425; // 0x290(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526; // 0x2A8(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627; // 0x2C0(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728; // 0x2D8(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829; // 0x2F0(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930; // 0x308(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031; // 0x320(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132; // 0x338(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233; // 0x350(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334; // 0x368(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435; // 0x380(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536; // 0x398(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637; // 0x3B0(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738; // 0x3C8(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839; // 0x3E0(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940; // 0x3F8(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041; // 0x410(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142; // 0x428(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243; // 0x440(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344; // 0x458(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142434445; // 0x470(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243444546; // 0x488(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344454647; // 0x4A0(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142434445464748; // 0x4B8(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849; // 0x4D0(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950; // 0x4E8(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051; // 0x500(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152; // 0x518(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253; // 0x530(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354; // 0x548(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455; // 0x560(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556; // 0x578(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657; // 0x590(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758; // 0x5A8(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859; // 0x5C0(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960; // 0x5D8(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061; // 0x5F0(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162; // 0x608(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263; // 0x620(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364; // 0x638(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465; // 0x650(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566; // 0x668(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667; // 0x680(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768; // 0x698(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869; // 0x6B0(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970; // 0x6C8(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071; // 0x6E0(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172; // 0x6F8(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970717273; // 0x710(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374; // 0x728(0x18)()
	class FText                                  Temp_text_Variable123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475; // 0x740(0x18)()
	class FText                                  Temp_text_Variable12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061626364656667686970717273747576; // 0x758(0x18)()
	class FText                                  Temp_text_Variable1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374757677; // 0x770(0x18)()
	class FText                                  CallFunc_MakeLiteralText_ReturnValue;              // 0x788(0x18)()
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue;              // 0x7A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x7A8(0x40)(HasGetValueTypeHash)
	enum class EFortRarity                       CallFunc_GetRarity_ReturnValue;                    // 0x7E8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4975[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue1;             // 0x7F0(0x18)()
	struct FFortRarityItemData                   CallFunc_BPGetRarityData_ReturnValue;              // 0x808(0x80)()
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData1;             // 0x888(0x40)(HasGetValueTypeHash)
	struct FFortRarityItemData                   CallFunc_BPGetRarityData_ReturnValue1;             // 0x8C8(0x80)()
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData12;            // 0x948(0x40)(HasGetValueTypeHash)
	struct FFortRarityItemData                   CallFunc_BPGetRarityData_ReturnValue12;            // 0x988(0x80)()
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData123;           // 0xA08(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0xA48(0x10)(ZeroConstructor, ReferenceParm)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData1234;          // 0xA58(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue;                       // 0xA98(0x18)()
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue1;             // 0xAB0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorker*                           K2Node_DynamicCast_AsFort_Worker;                  // 0xAB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0xAC0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EFortInventoryFilter              CallFunc_GetFilterCategory_ReturnValue;            // 0xAC1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0xAC2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4976[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue12;            // 0xAC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_GetTertiaryCategory_ItemCategoryText;     // 0xAD0(0x18)()
	struct FSlateBrush                           CallFunc_GetTertiaryCategory_ItemCategoryBrush;    // 0xAE8(0x88)()
	bool                                         CallFunc_GetTertiaryCategory_ReturnValue;          // 0xB70(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4977[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue123;           // 0xB78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData12345;         // 0xB80(0x40)(HasGetValueTypeHash)
	enum class EFortItemType                     CallFunc_GetType_ReturnValue;                      // 0xBC0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4978[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array1;                           // 0xBC8(0x10)(ZeroConstructor, ReferenceParm)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0xBD8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4979[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue1;                      // 0xBE0(0x18)()
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue1234;          // 0xBF8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFortItemType                     CallFunc_GetType_ReturnValue1;                     // 0xC00(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_497A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default;                             // 0xC08(0x18)()
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData123456;        // 0xC20(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array12;                          // 0xC60(0x10)(ZeroConstructor, ReferenceParm)
	class FText                                  CallFunc_Format_ReturnValue12;                     // 0xC70(0x18)()
};

// 0x1 (0x1 - 0x0)
// Function RewardInfoButtonWidget.RewardInfoButtonWidget_C.SetShowDescriptionBP
struct URewardInfoButtonWidget_C_SetShowDescriptionBP_Params
{
public:
	bool                                         bInShowDescription;                                // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x0 (0x0 - 0x0)
// Function RewardInfoButtonWidget.RewardInfoButtonWidget_C.HandleDifferentItemOrQuantitySetBP
struct URewardInfoButtonWidget_C_HandleDifferentItemOrQuantitySetBP_Params
{
public:
};

// 0x142 (0x142 - 0x0)
// Function RewardInfoButtonWidget.RewardInfoButtonWidget_C.ExecuteUbergraph_RewardInfoButtonWidget
struct URewardInfoButtonWidget_C_ExecuteUbergraph_RewardInfoButtonWidget_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESlateVisibility                  Temp_byte_Variable;                                // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_Event_bInShowDescription;                   // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_497B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_GetQuantity_ReturnValue;                  // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_497C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue;              // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Greater_IntInt_ReturnValue;               // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_497D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFortItemDefinition*                   CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_GetDisplayName_ReturnValue;               // 0x28(0x18)()
	class FText                                  CallFunc_Conv_IntToText_ReturnValue;               // 0x40(0x18)()
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x58(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_GetEmptyText_ReturnValue;                 // 0x98(0x18)()
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0xB0(0x10)(ZeroConstructor, ReferenceParm)
	bool                                         CallFunc_EqualEqual_TextText_ReturnValue;          // 0xC0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_497E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue;                       // 0xC8(0x18)()
	class UFortItem*                             CallFunc_GetItemInstance_ReturnValue1;             // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                   CallFunc_GetItemDefinitionBP_ReturnValue1;         // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_GetDisplayName_ReturnValue1;              // 0xF0(0x18)()
	class FText                                  CallFunc_GetDisplayName_DisplayName;               // 0x108(0x18)()
	enum class ESlateVisibility                  Temp_byte_Variable1;                               // 0x120(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_497F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_GetEmptyText_ReturnValue1;                // 0x128(0x18)()
	bool                                         Temp_bool_Variable;                                // 0x140(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select_Default;                             // 0x141(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
