#pragma once

// Fortnite (7.4) SDK
// Dumped with <3 by android#1337

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_MenusScreen_AnimBP.Fortnite_M_Avg_Player_MenusScreen_AnimBP_C
// 0x110C (0x53BC - 0x42B0)
class UFortnite_M_Avg_Player_MenusScreen_AnimBP_C : public UFortPlayerAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x42B0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_A674FFBF48506B9BA7EE8CBDBC8210BD;      // 0x42B8(0x0020)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE;// 0x42D8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_B299A69E447E60EE4F7B6C8FBE368C16;// 0x4300(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult;                                // 0x4378(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer;                             // 0x4398(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult02;                              // 0x4410(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine;                               // 0x4430(0x00B0)
	struct FAnimNode_BlendListByInt                    AnimGraphNode_BlendListByInt;                             // 0x44E0(0x00A0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult;                           // 0x4580(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer02;                           // 0x45A8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DEF0FA8B424C71AC423D7F827E27D566;// 0x4620(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer03;                           // 0x4640(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C5353AF9471A1BD5399A9CA462567314;// 0x46B8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine02;                             // 0x46D8(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FCD8E69443C0A585805514BA49F1D848;// 0x4788(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer04;                           // 0x47B0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A5671DD44544B7D8FE344C948A1F6D5F;// 0x4828(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer05;                           // 0x4848(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DCDAAE584818E91CC81A0BA12944C016;// 0x48C0(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine03;                             // 0x48E0(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult02;                         // 0x4990(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer06;                           // 0x49B8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult03;                              // 0x4A30(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer07;                           // 0x4A50(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult04;                              // 0x4AC8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_FA4F2A1D4B990DE217B853803767EFEA;// 0x4AE8(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_D53EBE274630FE146FC57C9C40922FA4;// 0x4B98(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_CBF0067242E2BBE0B1BE1AAB460C3E97;// 0x4BC0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_FFC399704D92F63AF22597B83C150F11;// 0x4C38(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer08;                           // 0x4C58(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult05;                              // 0x4CD0(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine04;                             // 0x4CF0(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_DD721A434BAE1DC3B4791ABEF2973E96;// 0x4DA0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer09;                           // 0x4DC8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult06;                              // 0x4E40(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer10;                           // 0x4E60(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult07;                              // 0x4ED8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_DEEE76B9479CA855B13ACDB7B1ADD3DE;// 0x4EF8(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult03;                         // 0x4FA8(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer11;                           // 0x4FD0(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_AFE7D68B41BDD2DFC8A938853BBACE1C;// 0x5048(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F91BF94341E4790BEA4E0CAAE54C94B4;// 0x5068(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult08;                              // 0x50E0(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine05;                             // 0x5100(0x00B0)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult04;                         // 0x51B0(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer12;                           // 0x51D8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult09;                              // 0x5250(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_E6363B3848E7E34F43DA088E680182A5;// 0x5270(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_F169FFA74713A776C1D5A4A712A655F2;// 0x52E8(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine06;                             // 0x5308(0x00B0)
	int                                                ClassNameInt;                                             // 0x53B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass Fortnite_M_Avg_Player_MenusScreen_AnimBP.Fortnite_M_Avg_Player_MenusScreen_AnimBP_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_D53EBE274630FE146FC57C9C40922FA4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_DD721A434BAE1DC3B4791ABEF2973E96();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_F1DB3E5A42B9996B6785308036E85FAE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP_AnimGraphNode_TransitionResult_FCD8E69443C0A585805514BA49F1D848();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Fortnite_M_Avg_Player_MenusScreen_AnimBP(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
